<link href="../main.css" rel="stylesheet" type="text/css" />
<div class="page_header">Общая информация о специальности &quot;Инженерия программного обеспечения&quot;</div>

<p>Кафедра Программного инженерии готовит программистов с 1988 года. На протяжении истории развития специальность имела несколько постепенно изменяющимся названий - ПОВТАС - ПОАС - ПЗАС - ПИ - ИПО.</p>
<p>Кафедра программной инженерии готовит студентов по трем ступеням высшего образования: бакалавров  по специальности 121 «Инженерия программного обеспечения» (образовательная  программа «Программная инженерия»); магистров  по специальности 121 «Инженерия программного обеспечения» (по программам «Инженерия программного обеспечения» и «Программное обеспечение систем»); докторов философии по специальности 121 «Инженерия программного обеспечения». Учебные планы согласованы с международными стандартами подготовки программистов.
<p>Формы обучения – очная, заочная и заочно-дистанционная.
<img src="../Pic/entrant/hurra.jpg" width="436" height="280" style="float:right;">

<p>Программная инженерия - это инженерная дисциплина, связанная со всеми аспектами производства программного обеспечения от начальных стадий создания спецификации до поддержки системы после сдачи в эксплуатацию.</p>
<p>Индустрия программирования - одна из наиболее перспективных и динамических областей. Современные ІТ- компании обеспечивают интересные проекты, профессиональный рост и достойную зарплату. Прогнозы экономического развития области в нашей стране сдерживаются дефицитом квалифицированных кадров. </p>
<p>Образование в сфере Программной инженерии -это разумная инвестиция в свое будущее. У нас Вы научитесь не просто программировать (кодировать), а создавать программные продукты - анализировать требования, работать в команде разработчиков, тестировать и обеспечивать качество продукта, руководить программными проектами. </p>
<p>Кафедра программной инженерии имеет объем лицензионного приема на 355 человек на подготовку бакалавров по специальности 121 «Инженерия программного обеспечения» (образовательная  программа «Программная инженерия»).
<p>Студенты имеют широкие возможности свободного выбора дисциплин. Некоторые предметы преподаются на английском языке в отдельно сформированных группах.
<p>Начиная с 3 курса студенты проходят практическую подготовку в ведущих ІТ-компаниях Харькова и Украины. Договор о сотрудничестве между кафедрой ПИ ХНУРЭ и компаниями Global Logic, NIX Solutions,  EPAM Systems и Sigma Software позволил создать на кафедре лаборатории по разработке современного программного обеспечения.
<p>Практикуется привлечение ведущих специалистов фирм к преподаванию профессионально-ориентированных дисциплин, осуществляется целевая подготовка студентов старших курсов в форме бесплатных факультативных занятий от компаний.
<p>Во время обучения студенты повышают свой профессиональный уровень, участвуют в работе семинаров и кружков, организованных на базе научных лабораторий, кружка «Программист» (где студенты получают знания и навыки по решению олимпиадных задач по программированию), лаборатории GameDev (где готовят студентов к разработке игровых проектов), участвуют в  проекте «IT Talents» (углубленное изучение сложных алгоритмов с практическим их применением в различных областях IТ).
<p>Неоднократно студенты кафедры ПИ занимали призовые места на украинских и международных соревнованиях по программированию, достойно представляли кафедру и университет на выставках, конкурсах, конференциях и форумах.

<div class="page_header">Профессиональная деятельность</div>

<p>Выпускники специальности "Инженерия программного обеспечения" могут работать на таких должностях: программист, тестировщик программного обеспечения, архитектор программных систем, аналитик, менеджер программных проектов, инженер по качеству программных продуктов. </p>
<p>Наши выпускники работают в ведущих ІТ компаниях региона, таких Nix Solutions, GlobalLogic, Eclipse SP, Stella Systems, Ciklum, Mondo ODC Ukraine, Инфострой, Gameloft, Murano Software, Program-Ace, Epam и других. Лучшие выпускники работают в таких всемирно известных компаниях как Facebook и Yandex.</p>


<div class="page_header">Условия приема</div>

<p>Внимание! Как правило, в последнее время правила приема ежегодно меняются.

<p>С условиями приема вы можете ознакомиться <a href="http://nure.ua/ru/abiturientam">здесь</a>.
</p>
<p>Учебные планы и  программы доступны   <a href="https://nure.ua/abituriyentam/spetsialnosti-ta-spetsializatsiyi/spetsialnist-121-inzheneriya-programnogo-zabezpechennya">тут </a>.

</p>
<iframe width="560" height="315" src="https://www.youtube.com/embed/0AyIEPzPdJ0?t=2475" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>

<iframe width="560" height="315" src="https://www.youtube.com/embed/6MJFACIF6wc" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
<iframe width="560" height="315" src="https://www.youtube.com/embed/qDA0Z79ARU8" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>

<p>  <a href="https://www.youtube.com/embed/_W7jpy_MAZo">Открытие лаборатории  GameDev</a>.
