<link href="../main.css" rel="stylesheet" type="text/css" />
<div class="page_header">Загальна інформація про спеціальність &quot;Інженерія програмного забезпечення&quot;</div>

</p>Кафедра Програмної інженерії готовит програмістів з 1988 року. Впродовж історії розвитку спеціальність мала декілька поступово змінюваніх назв - ПЗОТАС - ПЗАС - ПІ - ІПЗ.<p>
</p>Кафедра програмної інженерії готує студентів за трьома ступенями вищої освіти: бакалаврів за спеціальністю 121 «Інженерія програмного забезпечення» (освітня програмою «Програмна інженерія»); магістрів за спеціальністю 121 «Інженерія програмного забезпечення» (за програмами «Інженерія програмного забезпечення» та «Програмне забезпечення систем»); докторів філософії – за спеціальністю 121 «Інженерія програмного забезпечення».
Навчальні плани узгоджено з міжнародними стандартами підготовки програмістів. 
</p>Форма навчання – очна, заочна та заочно-дистанційна.
<img src="../Pic/entrant/hurra.jpg" width="436" height="280" style="float:right;">
<p>Інженерія програмного забезпечення - це інженерна дисципліна, яка пов'язана зі всіма аспектами виробництва програмного забезпечення від початкових стадій створення специфікації до підтримки системи після здачі в експлуатацію.</p>
<p>Індустрія програмування - одна з найбільш перспективних і динамічних галузей. Сучасні ІТ- компанії забезпечують цікаві проекти, професійне зростання та гідну зарплату. Прогнози економічного розвитку галузі в нашій країні стримуються дефіцитом кваліфікованих кадрів.  </p>
<p>Освіта у сфері програмної інженерії - це розумна інвестиція у своє майбутнє. У нас Ви навчитеся не просто програмувати (кодувати), а створювати програмні продукти - аналізувати вимоги, працювати в команді розробників, тестувати та забезпечувати якість продукту, керувати програмними проектами. </p>
<p>Кафедра програмної інженерії має обсяг ліцензійного прийому на 355 осіб на підготовку спеціальності "Інженерія програмного забезпечення" (освітня програма «Програмна інженерія»).</p>
<p>Студенти мають широкі можливості вільного вибору дисциплін. Деякі предмети викладаються англійською мовою у окремо сформованих групах.
<p>Починаючи з 3 курсу студенти проходять практику в провідних ІТ-компаніях Харкова та України. Договір про співробітництво між кафедрою ПІ ХНУРЕ та компаніями Global Logic, EPAM Systems, NIX Solutions та Sigma Software дозволив створити на кафедрі лабораторії з розробки сучасного програмного забезпечення. 
<p>Практикується залучення провідних спеціалістів фірм до викладання професійно-орієнтованих дисциплін, здійснюється цільова підготовка студентів старших курсів у формі безкоштовних факультативних занять від компаній.
<p>Під час навчання студенти підвищують свій професійний рівень, беруть участь у роботі семінарів і гуртків, організованих на базі наукових лабораторій, гуртка «Програміст» (де студенти здобувають знання та навички з вирішування олімпіадних завдань з програмування), лабораторії GameDev (де готують студентів до розробки ігрових проектів), беруть участь у проекті «IT Talents» (що передбачає поглиблене вивчення складних алгоритмів з практичним їх застосуванням в різних областях ІТ). 
<p>Неодноразово студенти кафедри ПІ посідали призові місця на українських та міжнародних змаганнях з програмування, гідно представляли кафедру та університет на виставках, конкурсах, конференціях та форумах.





<div class="page_header">Професійна діяльність</div>

<p>Випускники спеціальності "Інженерія програмного забезпечення"  можуть працювати на таких посадах: програміст, тестувальник програмного забезпечення, архітектор програмних систем, аналітик, менеджер програмних проектів, інженер з якості програмних продуктів. </p>
<p>Випускники працюють в провідних ІТ компаніях регіону, таких Nix Solutions, GlobalLogic, Eclipse SP, Stella Systems, Ciklum, Mondo ODC Ukraine, Інфострой, Gameloft, Murano Software, Program-Ace, Epam і інших. Кращі випускники працюють в таких всесвітньо відомих компаніях як Facebook і Yandex.


<div class="page_header">Умови прийому</div>

<p>Увага! Як правило, останнім часом правила прийому щорічно змінюються. 
<p>Умови прийому ви можете прочитати  <a href="http://nure.ua/abituriyentam">тут </a>.

</p>
<p>Навчальні плани і програми доступні   <a href="https://nure.ua/abituriyentam/spetsialnosti-ta-spetsializatsiyi/spetsialnist-121-inzheneriya-programnogo-zabezpechennya">тут </a>.

</p>
<iframe width="560" height="315" src="https://www.youtube.com/embed/0AyIEPzPdJ0?t=2475" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
<iframe width="560" height="315" src="https://www.youtube.com/embed/6MJFACIF6wc" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
<iframe width="560" height="315" src="https://www.youtube.com/embed/qDA0Z79ARU8" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>

<p>  <a href="https://www.youtube.com/embed/_W7jpy_MAZo">Відкриття лабораторії  GameDev</a>.

